tortuousVessel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;   // OpenFOAM v10+ SIMPLE solver

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;       // SIMPLE iterations (steady-state)

deltaT          1;         // pseudo time-step (= 1 iteration)

writeControl    timeStep;
writeInterval   50;        // save results every 50 iterations

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;

writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
