tortuousVessel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// O-grid circular cross-section for the tortuous vessel.
// Geometry taken from spiralPipe tutorial.
// Vertices 0-7  are at zMin (inlet end, bottom of short cylinder).
// Vertices 8-15 are at zMax (outlet end, top — will be extruded along curve).
//

radius      0.25;   // pipe radius [m]  (large scale – learning geometry)
box         0.07;   // inner-square half-side for O-grid
zMax        0;
zMin       -0.1;
nB          8;      // cells in tangential / box direction
nR          12;     // cells in radial direction
nZ          1;      // cells along z (just 1 – axial layers come from extrusion)

radiusNeg   #neg $radius;
boxNeg      #neg $box;

verbose no;

geometry
{
    cylinder
    {
        type      cylinder;
        point1    (0 0 -210);
        point2    (0 0  240);
        radius    $radius;
    }
}

vertices
(
    // ---- bottom layer (zMin) ---- vertices 0-7
    // Inner square corners
    ($boxNeg $boxNeg $zMin)              // 0
    ($box    $boxNeg $zMin)              // 1
    ($boxNeg $box    $zMin)              // 2
    ($box    $box    $zMin)              // 3

    // Outer arc corners (projected onto cylinder)
    project ($radiusNeg $radiusNeg $zMin) (cylinder)  // 4
    project ($radius    $radiusNeg $zMin) (cylinder)  // 5
    project ($radiusNeg $radius    $zMin) (cylinder)  // 6
    project ($radius    $radius    $zMin) (cylinder)  // 7

    // ---- top layer (zMax) ---- vertices 8-15
    // Inner square corners
    ($boxNeg $boxNeg $zMax)              // 8
    ($box    $boxNeg $zMax)              // 9
    ($boxNeg $box    $zMax)              // 10
    ($box    $box    $zMax)              // 11

    // Outer arc corners (projected onto cylinder)
    project ($radiusNeg $radiusNeg $zMax) (cylinder)  // 12
    project ($radius    $radiusNeg $zMax) (cylinder)  // 13
    project ($radiusNeg $radius    $zMax) (cylinder)  // 14
    project ($radius    $radius    $zMax) (cylinder)  // 15
);

blocks
(
    hex ( 4  5  1  0 12 13  9  8) ($nB $nR $nZ) simpleGrading (1 1 1)
    hex ( 4  0  2  6 12  8 10 14) ($nR $nB $nZ) simpleGrading (1 1 1)
    hex ( 1  5  7  3  9 13 15 11) ($nR $nB $nZ) simpleGrading (1 1 1)
    hex ( 2  3  7  6 10 11 15 14) ($nB $nR $nZ) simpleGrading (1 1 1)
    hex ( 0  1  3  2  8  9 11 10) ($nB $nB $nZ) simpleGrading (1 1 1)
);

edges
(
    // Arc edges projected onto the cylinder surface
    project  4  5 (cylinder)
    project  7  5 (cylinder)
    project  6  7 (cylinder)
    project  4  6 (cylinder)
    project 12 13 (cylinder)
    project 13 15 (cylinder)
    project 12 14 (cylinder)
    project 14 15 (cylinder)
);

defaultPatch
{
    type patch;
    name defaultFaces;
}

boundary
(
    // inlet: the bottom cross-section (zMin).
    // Flow enters here and travels up through the pipe and along the spiral.
    inlet
    {
        type patch;
        faces
        (
            (4 5 1 0)   // bottom of block 1
            (4 0 2 6)   // bottom of block 2
            (1 5 7 3)   // bottom of block 3
            (2 3 7 6)   // bottom of block 4
            (0 1 3 2)   // bottom of central block
        );
    }

    // walls: lateral cylindrical surface of the short straight section.
    // After extrudeMesh the spiral-pipe barrel walls are appended here.
    walls
    {
        type wall;
        faces
        (
            ( 4  5 13 12)   // bottom-arc wall segment
            ( 4  6 14 12)   // left-arc  wall segment
            ( 5  7 15 13)   // right-arc wall segment
            ( 6  7 15 14)   // top-arc   wall segment
        );
    }

    // outlet: the top cross-section (zMax).
    // extrudeMesh will sweep this face along the spiral curve.
    // After extrusion it becomes the far end of the spiral (flow exit).
    outlet
    {
        type patch;
        faces
        (
            (12 13  9  8)
            (12  8 10 14)
            ( 9 13 15 11)
            (10 11 15 14)
            ( 8  9 11 10)
        );
    }
);

// ************************************************************************* //
